# Задача 1
a = int(input("Введите число: "))
b = int(input("Введите второе число: "))
word = "Hi"
while a < b:
    a += 1
    print("Результат: %s" %a)

for i in word:
    print(i)